<html>
<head>
  <?php
    include_once 'bibl/bibl.html';
  ?>
  <title>Что такое PHP? Протестировать PHP код. О клиенте.</title>
  <meta name="description" content="Небольшой ввод в проект. Для чего это? Что такое PHP? Представляем Вам проект для упрощения освоения языка PHP">
  <meta name="keywords" content="Что такое PHP, примеры PHP, как выполнить PHP код">
</head>
<body>
  <?php
    include_once 'bibl/header.html';
  ?>
<div class="content">
  <div class="podl">
    <h1 style="text-align:center;">О клиенте.</h1>
    <h2>Как пользоваться?</h2>
    <span><p>На главной расположены текстовые поля, в которые можно вводить свой код PHP онлайн.</p>
    <p>1) Для переноса вывода данных на следующую строку необходимо использовать HTML тег <code> &lt;br&gt;</code> или <code>\n</code></p>
    <p>2) Некоторые системные функции заблокированы в качестве безопасности. Просьба обходиться без них.</p>
    <p>3) Не забываем добавлять страницу в закладки и оставлять свои отзывы/идеи для улучшения проекта в обратную связь!</p></span>
    <h2>Для чего нужен проект?</h2>
    <span>Данный проект создавался непосредственно для того, что бы облегчить работу при выполнении PHP кода.
      С данным web-приложением не нужно устанавливать сервер на компьютер,
      достаточно ввести необходимый код в текстовое поле <a href="index.php">здесь</a>
    </span>
    <h2>Что такое PHP?</h2>
    <p>Определение взято с сайта <a target="_blank" rel="nofollow" href="http://www.php.su/php/?php">php.su</a></p>
    <blockquote><span>PHP – это широко используемый язык сценариев общего назначения с открытым исходным кодом.</span></blockquote>
    <p>Основа синтаксиса языка взяла начало с таких языков программирования как: <ul>
      <li>C</li>
      <li>Java</li>
      <li>Perl</li>
    </ul>
    PHP прост в изучении. Основным преимуществом является возможность генерации динамических web-страниц.
    </p>
      <p><span>Как пример на главной странице вы можете использовать следующий PHP код:<br />
        <code>
            echo "Hello World";
        </code>
      </span>
      <br />Данный пример позволяет вывести на экран сообщение "Hello World";
      </p>
  </div>
</div>
</body>
</html>
